khoih-prog/AsyncWebServer_STM32/src/AsyncWebServer_STM32.h
/****************************************************************************************************************************
  AsyncWebServer_STM32.h - Dead simple AsyncWebServer for STM32 LAN8720 or built-in LAN8742A Ethernet

  For STM32 with LAN8720 (STM32F4/F7) or built-in LAN8742A Ethernet (Nucleo-144, DISCOVERY, etc)
  
  AsyncWebServer_STM32 is a library for the STM32 with LAN8720 or built-in LAN8742A Ethernet WebServer
  
  Based on and modified from ESPAsyncWebServer (https://github.com/me-no-dev/ESPAsyncWebServer)
  Built by Khoi Hoang https://github.com/khoih-prog/AsyncWebServer_STM32
  
  Copyright (c) 2016 Hristo Gochkov. All rights reserved.
  This file is part of the esp8266 core for Arduino environment.
  This program is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License 
  as published bythe Free Software Foundation, either version 3 of the License, or (at your option) any later version.
  This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License for more details.
  You should have received a copy of the GNU General Public License along with this program.
  If not, see <https://www.gnu.org/licenses/>

  Version: 1.6.0

  Version Modified By   Date      Comments
  ------- -----------  ---------- -----------
  1.2.3   K Hoang      02/09/2020 Initial coding for STM32 for built-in Ethernet (Nucleo-144, DISCOVERY, etc).
                                  Bump up version to v1.2.3 to sync with ESPAsyncWebServer v1.2.3
  1.2.4   K Hoang      05/09/2020 Add back MD5/SHA1 authentication feature.
  1.2.5   K Hoang      28/12/2020 Suppress all possible compiler warnings. Add examples.
  1.2.6   K Hoang      22/03/2021 Fix dependency on STM32AsyncTCP Library
  1.3.0   K Hoang      14/04/2021 Add support to LAN8720 using STM32F4 or STM32F7
  1.3.1   K Hoang      09/10/2021 Update `platform.ini` and `library.json`
  1.4.0   K Hoang      14/12/2021 Fix base64 encoding of websocket client key and add WebServer progmem support
  1.4.1   K Hoang      12/01/2022 Fix authenticate issue caused by libb64
  1.5.0   K Hoang      22/06/2022 Update for STM32 core v2.3.0
  1.6.0   K Hoang      06/10/2022 Option to use non-destroyed cString instead of String to save Heap
 *****************************************************************************************************************************/

#ifndef _AsyncWebServer_STM32_H_
#define _AsyncWebServer_STM32_H_

/////////////////////////////////////////////////

#define ASYNC_WEBSERVER_STM32_VERSION           "AsyncWebServer_STM32 v1.6.0"

#define ASYNC_WEBSERVER_STM32_VERSION_MAJOR     1
#define ASYNC_WEBSERVER_STM32_VERSION_MINOR     6
#define ASYNC_WEBSERVER_STM32_VERSION_PATCH     0

#define ASYNC_WEBSERVER_STM32_VERSION_INT       1006000

/////////////////////////////////////////////////

#ifndef AWS_STM32_UNUSED
  #define AWS_STM32_UNUSED(x) (void)(x)
#endif

/////////////////////////////////////////////////

#include "Arduino.h"
#include <functional>

#include <STM32AsyncTCP.h>

#include "AsyncWebServer_Debug_STM32.h"
#include "StringArray_STM32.h"

/////////////////////////////////////////////////

#ifdef ASYNCWEBSERVER_REGEX
  #if(_ASYNCWEBSERVER_STM32_LOGLEVEL_>3)
    #warning Using ASYNCWEBSERVER_REGEX
  #endif
  
  #define ASYNCWEBSERVER_REGEX_ATTRIBUTE
#else
  #define ASYNCWEBSERVER_REGEX_ATTRIBUTE __attribute__((warning("ASYNCWEBSERVER_REGEX not defined")))
#endif

#define DEBUGF(...) Serial.printf(__VA_ARGS__)

static const String SharedEmptyString = String();

/////////////////////////////////////////////////

class AsyncWebServer;
class AsyncWebServerRequest;
class AsyncWebServerResponse;
class AsyncWebHeader;
class AsyncWebParameter;
class AsyncWebRewrite;
class AsyncWebHandler;
class AsyncStaticWebHandler;
class AsyncCallbackWebHandler;
class AsyncResponseStream;

/////////////////////////////////////////////////

#ifndef WEBSERVER_H
  typedef enum
  {
    HTTP_GET     = 0b00000001,
    HTTP_POST    = 0b00000010,
    HTTP_DELETE  = 0b00000100,
    HTTP_PUT     = 0b00001000,
    HTTP_PATCH   = 0b00010000,
    HTTP_HEAD    = 0b00100000,
    HTTP_OPTIONS = 0b01000000,
    HTTP_ANY     = 0b01111111,
  } WebRequestMethod;
#endif

//if this value is returned when asked for data, packet will not be sent and you will be asked for data again
#define RESPONSE_TRY_AGAIN 0xFFFFFFFF

typedef uint8_t WebRequestMethodComposite;
typedef std::function<void(void)> ArDisconnectHandler;

/////////////////////////////////////////////////
/////////////////////////////////////////////////

/*
   PARAMETER :: Chainable object to hold GET/POST and FILE parameters
 * */

class AsyncWebParameter
{
  private:
    String _name;
    String _value;
    size_t _size;
    bool _isForm;
    bool _isFile;

  public:

    AsyncWebParameter(const String& name, const String& value, bool form = false, bool file = false, size_t size = 0)
        : _name(name), _value(value), _size(size), _isForm(form), _isFile(file)  {}

    /////////////////////////////////////////////////
    
    inline const String& name() const 
    {
      return _name;
    }

    /////////////////////////////////////////////////
    
    inline const String& value() const 
    {
      return _value;
    }

    /////////////////////////////////////////////////
    
    inline size_t size() const 
    {
      return _size;
    }

    /////////////////////////////////////////////////
    
    inline bool isPost() const 
    {
      return _isForm;
    }

    /////////////////////////////////////////////////
    
    inline bool isFile() const 
    {
      return _isFile;
    }

    /////////////////////////////////////////////////
};

/////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////

/*
   HEADER :: Chainable object to hold the headers
 * */

class AsyncWebHeader
{
  private:
    String _name;
    String _value;

