khoih-prog/AsyncWebServer_STM32/src/AsyncWebServer_STM32.h
    AsyncWebServerResponse *beginResponse(int code, const String& contentType = String(), const String& content = String());
    AsyncWebServerResponse *beginResponse(int code, const String& contentType, const char * content = nullptr); // RSMOD
    
    // KH add
    AsyncWebServerResponse *beginResponse(int code, const String& contentType, const uint8_t * content, size_t len, 
                                          AwsTemplateProcessor callback = nullptr);
    //////
    
    AsyncWebServerResponse *beginResponse(Stream &stream, const String& contentType, size_t len, AwsTemplateProcessor callback = nullptr);
    AsyncWebServerResponse *beginResponse(const String& contentType, size_t len, AwsResponseFiller callback, 
                                          AwsTemplateProcessor templateCallback = nullptr);
    AsyncWebServerResponse *beginResponse_P(int code, const String& contentType, const uint8_t * content, 
                                            size_t len, AwsTemplateProcessor callback=nullptr);
    AsyncWebServerResponse *beginResponse_P(int code, const String& contentType, PGM_P content, AwsTemplateProcessor callback=nullptr);

    AsyncWebServerResponse *beginChunkedResponse(const String& contentType, AwsResponseFiller callback, 
                                                  AwsTemplateProcessor templateCallback = nullptr);
    AsyncResponseStream *beginResponseStream(const String& contentType, size_t bufferSize = 1460);

    size_t headers() const;                     // get header count
    bool hasHeader(const String& name) const;   // check if header exists

    AsyncWebHeader* getHeader(const String& name) const;
    AsyncWebHeader* getHeader(size_t num) const;

    size_t params() const;                      // get arguments count
    bool hasParam(const String& name, bool post = false , bool file = false) const;

    AsyncWebParameter* getParam(const String& name, bool post = false, bool file = false) const;
    AsyncWebParameter* getParam(size_t num) const;

    /////////////////////////////////////////////////

    inline size_t args() const 
    {
      return params();  // get arguments count
    }

    /////////////////////////////////////////////////

    const String& arg(const String& name) const; // get request argument value by name
    const String& arg(size_t i) const;           // get request argument value by number
    const String& argName(size_t i) const;       // get request argument name by number
    bool hasArg(const char* name) const;         // check if argument exists

    const String& ASYNCWEBSERVER_REGEX_ATTRIBUTE pathArg(size_t i) const;

    const String& header(const char* name) const;// get request header value by name
    const String& header(size_t i) const;        // get request header value by number
    const String& headerName(size_t i) const;    // get request header name by number
    String urlDecode(const String& text) const;
};

/////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////

/*
   FILTER :: Callback to filter AsyncWebRewrite and AsyncWebHandler (done by the Server)
 * */

typedef std::function<bool(AsyncWebServerRequest *request)> ArRequestFilterFunction;

bool ON_STA_FILTER(AsyncWebServerRequest *request);

bool ON_AP_FILTER(AsyncWebServerRequest *request);

/////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////

/*
   REWRITE :: One instance can be handle any Request (done by the Server)
 * */

class AsyncWebRewrite
{
  protected:
    String _from;
    String _toUrl;
    String _params;
    ArRequestFilterFunction _filter;

  public:
  
    /////////////////////////////////////////////////
  
    AsyncWebRewrite(const char* from, const char* to): _from(from), _toUrl(to), _params(String()), _filter(NULL) 
    {
      int index = _toUrl.indexOf('?');
      
      if (index > 0) 
      {
        _params = _toUrl.substring(index + 1);
        _toUrl = _toUrl.substring(0, index);
      }
    }

    /////////////////////////////////////////////////
    
    virtual ~AsyncWebRewrite() {}

    /////////////////////////////////////////////////
    
    inline AsyncWebRewrite& setFilter(ArRequestFilterFunction fn) 
    {
      _filter = fn;
      return *this;
    }

    /////////////////////////////////////////////////
     
    inline bool filter(AsyncWebServerRequest *request) const 
    {
      return _filter == NULL || _filter(request);
    }

    /////////////////////////////////////////////////
     
    inline const String& from() const 
    {
      return _from;
    }

    /////////////////////////////////////////////////
     
    inline const String& toUrl() const 
    {
      return _toUrl;
    }

    /////////////////////////////////////////////////
     
    inline const String& params() const 
    {
      return _params;
    }

    /////////////////////////////////////////////////
     
    virtual bool match(AsyncWebServerRequest *request) 
    {
      return from() == request->url() && filter(request);
    }
};

/////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////

/*
   HANDLER :: One instance can be attached to any Request (done by the Server)
 * */

class AsyncWebHandler
{
  protected:
    ArRequestFilterFunction _filter;
    String _username;
    String _password;

  public:
    AsyncWebHandler(): _username(""), _password("") {}

    /////////////////////////////////////////////////
     
    inline AsyncWebHandler& setFilter(ArRequestFilterFunction fn) 
    {
      _filter = fn;
      return *this;
    }

    /////////////////////////////////////////////////
     
    inline AsyncWebHandler& setAuthentication(const char *username, const char *password) 
    {
      _username = String(username);
      _password = String(password);
      return *this;
    };

    /////////////////////////////////////////////////
     
    inline bool filter(AsyncWebServerRequest *request) 
    {
      return _filter == NULL || _filter(request);
    }

    /////////////////////////////////////////////////
     
